Public Member Functions | Protected Attributes | List of all members
ACAPI::Impl::ObjectImpl Class Reference
API Infrastructure
ObjectImpl is the base class for all the implementation classes. More...
#include <ObjectImpl.hpp>
 Inheritance diagram for ACAPI::Impl::ObjectImpl:
 Public Member Functions
ObjectImpl (const API_Token &token)
Constructs an object of the ObjectImpl class.
const API_Token &  | GetToken () const
You can get the token that's used by the implementation.
 Protected Attributes
 const API_Token  | token
The token used by the implementation.
Detailed Description
ObjectImpl is the base class for all the implementation classes.
Since
Archicad 28